{
    "+": "UA-WATER",
    "ability scores": {
        "+": 0,
        "cha": 0,
        "con": 0,
        "dex": 0,
        "int": 0,
        "str": 1,
        "wis": 0
    },
    "age": "Minotaurs enter adulthood at around the age of 17 and can live up to 150 years.",
    "alignment": "Minotaurs believe in a strict code of honor, and thus tend toward law. They are loyal to the death and make implacable enemies, even as their brutal culture and disdain for weakness push them toward evil.",
    "description": [
        "# Minotaurs",
        "",
        "*Unearthed Arcana: Eberron*",
        "",
        "In the world of Krynn, the setting of the Dragonlance saga, minotaurs live in an honor-based society where strength determines power in both the gladiatorial arenas and in daily life. At home on both land and sea, the minotaurs of Krynn are ferocious sea raiders who rank as the ablest and most dangerous sailors in the world.",
        "",
        "## Arrogant Conquerors",
        "",
        "Minotaurs embrace the notion that the weak should perish and that the strong must rule-and that they themselves are the strongest and most powerful race on Krynn. They believe their destiny is to rule the world, and that their dominion will be one of conquest and military might. To that end, all minotaurs are trained in weapons, armor, and tactics from a young age.",
        "",
        "The minotaurs' arrogance stems from a combination of strength, cunning, and intellect-three virtues they hold dear, and which they deem the foundation of their greatness. They believe that this combination of traits is what sets them apart from their rivals.",
        "",
        "## Trial by Combat",
        "",
        "Minotaur society is built on the principle that might makes right, and that considerations of justice are unnecessary. The minotaurs are led by an emperor served by a council of eight minotaurs called the Supreme Circle. All posts within the government, including the emperor's, are won by the strongest and cleverest minotaurs, as proved by combat in the Circus.",
        "",
        "The Circus is the only means by which a minotaur can rise in society. It is a grand, annual display of single combat in which minotaurs battle each other for supremacy. Minotaur youths must prove themselves in the Circus to earn their passage to adulthood.",
        "",
        "Participation in the Circus is yet another reason why minotaurs look down on other folk. To the minotaurs, death and glory in battle are a natural process. Combat is the key to ensuring that the strong survive, and that the weak are set aside before they can undermine their superiors' grand schemes of conquest.",
        "",
        "## Honor above All",
        "",
        "For all their cruelty, minotaurs are bound by a powerful sense of honor. Each victory brings greater honor to both individual minotaurs and their families. Defeat invokes a stain that only death can fully wash away.",
        "",
        "Honor demands that minotaurs keep their word once it is offered, and each minotaur remains faithful to friends and clan above all else. Minotaurs rarely befriend folk of other races, as they all too often encounter them only in battle. If a minotaur does strike up a friendship, it is typically with other creatures that display the minotaurs' virtues and love of battle. To such friends, a minotaur becomes an ally whose support will never waver.",
        "",
        "## Sea Reavers",
        "",
        "In the world of Krynn, the minotaurs rule a chain of islands dominated by the isles of Mithas and Kothas. Bound by the sea on all sides, the minotaurs focused their tenacity, strength, and cunning to become some of the most skilled and ferocious mariners in the world. They range across the water in their ships, raiding and pillaging as they wish. Minotaurs sometimes engage in trade, but they much prefer to take what they want by force. After all, as the strongest of all folk, they deserve the treasures and goods that lesser creatures have gathered.",
        "",
        "## Minotaur Bonds",
        "",
        "When creating a minotaur character rooted in Krynn (or in any campaign that draws on the backstory presented here), you can use the following table of bonds to help flesh out your character. Use this table in addition to or in place of your background's bond or a bond of your creation.",
        "",
        "| d6 | Bond |",
        "|:--:|:-----|",
        "| 1  | My opponent in the Circus for my trial of adulthood was chosen years ago. Though we sparred only once, I fell deeply in love. Rather than fight my beloved to the death, I fled from home and have been branded a coward. |",
        "| 2  | I'm the last of my clan. If I die without achieving great deeds, the hero who is my clan's patron will be forgotten. |",
        "| 3  | I was part of a raiding party that was defeated and enslaved. I've escaped and sworn revenge. |",
        "| 4  | I never shared my people's love of violence. I'm part of a conspiracy to topple the emperor's violent regime.|",
        "| 5  | I claim that I am an exile from my people, but in truth I have been sent to serve as a spy. I'm expected to leave secret messages telling my folk of villages and towns that are ripe targets for conquest. |",
        "| 6  | I'm the last survivor of a ship wrecked in a storm. Occasionally, the spirits of my shipmates appear in my dreams and ask me to complete tasks they left unfinished in life. |",
        "",
        "## Minotaurs in Your Campaign",
        "",
        "We chose the minotaurs of Krynn as the model for our depiction of this race for a very specific reason. Tying them to the sea and a distinct culture helps give minotaurs more flavor than serving as just another big, brutish monster race. After all, we already have half- orcs in the Player's Handbook and the goliath in our Elemental Evil Player's Companion. As an added bonus, these minotaurs are Medium (as opposed to Large for the monstrous version) and are thus much easier to balance against the Player's Handbook races.",
        "",
        "Casting minotaurs as conquest-minded, honorable pirates gives them a distinct flavor while providing many roleplaying hooks for players. When adding a new race to your own campaign, it's always a good idea to think about its culture, its relationship to other folk, and how the two can combine to give it a unique place in your world. Creating a table of bonds such as the one provided for minotaurs can be a good place to start.",
        "",
        "Casting minotaurs as mariners has some interesting implications for a setting. The Labyrinthine Recall ability makes minotaurs perfect sailors, as they can travel the seas with little fear of becoming lost or losing their way. A minotaur navigator is an unmatched master of the sea. When adapting races to your campaign, look for similar hooks that might be buried in special abilities or elements of a creature's story that you might otherwise overlook.",
        "",
        "Remember that the story we provide is only a starting point. Modifying this minotaur to move it away from its roots in Krynn is as easy as swapping the proficiencies provided by Sea Reaver for some other option that better reflects your setting. As a guideline, consider swapping the tool proficiencies for proficiency in any one skill, for proficiency with thieves' tools, or for proficiency with two tools other than thieves' tools."
    ],
    "languages": [
        "Common"
    ],
    "name": "Minotaur",
    "size": "Medium",
    "size description": "Minotaurs typically stand well over 6 feet tall and weigh an average of 300 pounds. Your size is {size}.",
    "speed": 30,
    "tool proficiencies": [
        "navigator's tools",
        "vehicles (water)"
    ],
    "traits": [
        [
            "Conqueror's Virtue",
            "From a young age, you focused on one of the three virtues of strength, cunning, or intellect. Your choice of your Strength, Intelligence, or Wisdom score increases by 1."
        ],
        [
            "Horns",
            "You are never unarmed. You are proficient with your horns, which are a melee weapon that deals 1d10 piercing damage. Your horns grant you advantage on all checks made to shove a creature, but not to avoid being shoved yourself."
        ],
        [
            "Goring Rush",
            "When you use the Dash action during your turn, you can make a melee attack with your horns as a bonus action."
        ],
        [
            "Hammering Horns",
            "When you use the Attack action during your turn to make a melee attack, you can attempt to shove a creature with your horns as a bonus action. You cannot use this shove attempt to knock a creature prone."
        ],
        [
            "Labyrinthine Recall",
            "You can perfectly recall any path you have traveled."
        ]
    ]
}