{
    "+": "SCAG",
    "@": "Dwarf",
    "ability scores": {
        "+": 0,
        "cha": 0,
        "con": 0,
        "dex": 0,
        "int": 0,
        "str": 1,
        "wis": 0
    },
    "description": "*Sword Coast Adventurer's Guide*\n\nThe gray dwarves, or duergar, live deep in the Underdark. After delving deeper than any other dwarves, they were enslaved by mind flayers for eons. Although they eventually won their freedom, these grim, ashen-skinned dwarves now take slaves of their own and are as tyrannical as their former masters.\n\nPhysically similar to other dwarves in some ways, duergar are wiry and lean, with black eyes and bald heads, with the males growing long, unkempt, gray beards.\n\nDuergar value toil above all else. Showing emotions other than grim determination or wrath is frowned on in their culture, but they can sometimes seem joyful when at work. They have the typical dwarven appreciation for order, tradition, and impeccable craftsmanship, but their goods are purely utilitarian, disdaining aesthetic or artistic value.\n\nFew duergar become adventurers, fewer still on the surface world, because they are a hidebound and suspicious race. Those who leave their subterranean cities are usually exiles. Check with your Dungeon Master to see if you can play a gray dwarf character.",
    "languages": [
        "Undercommon"
    ],
    "name": "Duregar",
    "traits": [
        [
            "Superior Darkvision",
            "Your darkvision has a radius of 120 feet."
        ],
        [
            "Duregar Resilience",
            "You have advantage on saving throws against illusions and against being charmed or paralyzed."
        ],
        [
            "Duregar Magic",
            "When you reach 3rd level, you can cast the *enlarge/reduce* spell on yourself once with this trait, using only the spell's enlarge option. When you reach 5th level, you can cast the *invisibility* spell on yourself once with this trait. You don't need material components for either spell, and you can't cast them while you're in direct sunlight, although sunlight has no effect on them once cast. You regain the ability to cast these spells with this trait when you finish a long rest. Intelligence is your spellcasting ability for these spells.",
            "",
            "<spell>Enlarge/Reduce</spell>",
            "",
            "<spell>Invisibility</spell>"
        ],
        [
            "Sunlight Sensitivity",
            "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
        ]
    ]
}
