{
    "+": "PHB",
    "@": "Elf",
    "ability scores": {
        "+": 0,
        "cha": 1,
        "con": 0,
        "dex": 0,
        "int": 0,
        "str": 0,
        "wis": 0
    },
    "combat proficiencies": [
        "Rapiers",
        "Shortswords",
        "Hand Crossbows"
    ],
    "description": [
        "Descended from an earlier subrace of dark-skinned elves, the drow were banished from the surface world for following the goddess Lolth down the path to evil and corruption. Now they have built their own civilization in the depths of the Underdark, patterned after the Way of Lolth. Also called dark elves, the drow have black skin that resembles polished obsidian and stark white or pale yellow hair. They commonly have very pale eyes (so pale as to be mistaken for white) in shades of lilac, silver, pink, red, and blue. They tend to be smaller and thinner than most elves.",
        "",
        "Drow adventurers are rare, and the race does not exist in all worlds. Check with your Dungeon Master to see if you can play a drow character.",
        "",
        "> **The Darkness of the Drow**",
        ">",
        "> Were it not for one renowned exception, the race of drow would be universally reviled. To most, they are a race of demon-worshiping marauders dwelling in the subterranean depths of the Underdark, emerging only on the blackest nights to pillage and slaughter the surface dwellers they despise. Their society is depraved and preoccupied with the favor of Lolth, their spider-goddess, who sanctions murder and the extermination of entire families as noble houses vie for position.",
        ">",
        "> Yet one drow, at least, broke the mold. In the world of the Forgotten Realms, Drizzt Do'Urden, ranger of the North, has proven his quality as a good-hearted defender of the weak and innocent. Rejecting his heritage and adrift in a world that looks upon him with terror and loathing, Drizzt is a model for those few drow who follow in his footsteps, trying to find a life apart from the evil society of their Underdark homes.",
        ">",
        "> Drow grow up believing that surface-dwelling races are inferior, worthless except as slaves. Drow who develop a conscience or find it necessary to cooperate with members of other races find it hard to overcome that prejudice, especially when they are so often on the receiving end of hatred."
    ],
    "name": "Drow",
    "traits": [
        [
            "Superior Darkvision",
            "Your darkvision has a radius of 120 feet."
        ],
        [
            "Sunlight Sensitivity",
            "You have disadvantage on attack rolls and on Wisdom (Perception) checks that rely on sight when you, the target of your attack, or whatever you are trying to perceive is in direct sunlight."
        ],
        [
            "Drow Magic",
            "You know the *Dancing Lights* cantrip. When you reach 3rd level, you can cast the *Faerie Fire* spell once per day. When you reach 5th level, you can also cast the *Darkness* spell once per day. Charisma is your spellcasting ability for these spells.",
            "",
            "<spell>Dancing Lights</spell>",
            "",
            "<spell>Faerie Fire</spell>",
            "",
            "<spell>Darkness</spell>"
        ]
    ]
}
