{
    "+": "SCAG",
    "@": "Tiefling",
    "description": "*Sword Coast Adventurer's Guide*\n\nSince not all tieflings are of the blood of Asmodeus, some have traits that differ from those in the Player's Handbook. The Dungeon Master may permit the following variants for your tiefling character, although Devil's Tongue, Hellfire, and Winged are mutually exclusive.\n\nThese variations are based on the original Tiefling from the Player's Handbook. For the base stats to modify combine the Tiefling base race and the Infernal Legacy subrace.",
    "name": "Tiefling Variants",
    "traits": [
        [
            "Feral",
            "Your Intelligence score increases by 1, and your Dexterity score increases by 2. This trait replaces the Ability Score Increase trait."
        ],
        [
            "Appearance",
            "Your tiefling might not look like other tieflings. Rather than having the physical characteristics described in the Player's Handbook, choose 1d4 + 1 of the following features: small horns; fangs or sharp teeth; a forked tongue; catlike eyes; six fingers on each hand; goat-like legs; cloven hoofs; a forked tail; leathery or scaly skin; red or dark blue skin; cast no shadow or reflection; exude a smell of brimstone."
        ],
        [
            "Devil's Tongue",
            "You know the *vicious mockery* cantrip. When you reach 3rd level, you can cast the *charm person* spell as a 2nd-level spell once with this trait. When you reach 5th level, you can cast the *enthrall* spell once with this trait. You must finish a long rest to cast these spells once again with this trait. Charisma is your spellcasting ability for them. This trait replaces the Infernal Legacy Trait.",
            "",
            "<spell>Vicious Mockery</spell>",
            "",
            "<spell>Charm Person</spell>",
            "",
            "<spell>Enthrall</spell>"
        ],
        [
            "Hellfire",
            "Once you reach 3rd level, you can cast the *burning hands* spell once per day as a 2nd-level spell. This trait replaces the *hellish rebuke* spell of the Infernal Legacy trait.",
            "",
            "<spell>Burning Hands</spell>"
        ],
        [
            "Winged",
            "You have bat-like wings sprouting from your shoulder blades. You have a flying speed of 30 feet. This trait replaces the Infernal Legacy Trait."
        ]
    ]
}
