{
    "+": "UA-RANGERREVISED",
    "combat proficiencies": [
        "Light Armor",
        "Medium Armor",
        "Shields",
        "Simple Weapons",
        "Martial Weapons"
    ],
    "description": "A warrior who uses martial prowess and nature magic to combat threats on the edges of civilization",
    "equipment": [
        [
            "scale mail",
            "leather armor"
        ],
        [
            "two shortswords",
            "two simple melee weapons"
        ],
        [
            "dungeoneer's pack",
            "explorer's pack"
        ],
        [
            "A longbow and a quiver of 20 arrows"
        ]
    ],
    "features": [
        [
            1,
            [
                "Favored Enemy",
                "Beginning at 1st level, you have significant experience studying, tracking, hunting, and even talking to a certain type of enemy commonly encountered in the wilds.",
                "",
                "Choose a type of favored enemy: beasts, fey, humanoids, monstrosities, or undead. You gain a +2 bonus to damage rolls with weapon attacks against creatures of the chosen type. Additionally, you have advantage on Wisdom (Survival) checks to track your favored enemies, as well as on Intelligence checks to recall information about them.",
                "",
                "When you gain this feature, you also learn one language of your choice, typically one spoken by your favored enemy or creatures associated with it. However, you are free to pick any language you wish to learn."
            ],
            [
                "Natural Explorer",
                "You are a master of navigating the natural world, and you react with swift and decisive action when attacked. This grants you the following benefits:",
                "",
                "* You ignore difficult terrain.",
                "* You have advantage on initiative rolls.",
                "* On your first turn during combat, you have advantage on attack rolls against creatures that have not yet acted.",
                "",
                "In addition, you are skilled at navigating the wilderness. You gain the following benefits when traveling for an hour or more:",
                "",
                "* Difficult terrain doesn't slow your group's travel.",
                "* Your group can't become lost except by magical means.",
                "* Even when you are engaged in another activity while traveling (such as foraging, navigating, or tracking), you remain alert to danger.",
                "* If you are traveling alone, you can move stealthily at a normal pace.",
                "* When you forage, you find twice as much food as you normally would.",
                "* While tracking other creatures, you also learn their exact number, their sizes, and how long ago they passed through the area."
            ]
        ],
        [
            2,
            [
                "Fighting Style",
                "At 2nd level, you adopt a particular style of fighting as your specialty. Choose one of the following options. You can't take a Fighting Style option more than once, even if you later get to choose again.",
                "",
                "### Archery",
                "",
                "You gain a +2 bonus to attack rolls you make with ranged weapons.",
                "",
                "### Defense",
                "",
                "While you are wearing armor, you gain a +1 bonus to AC.",
                "",
                "### Dueling",
                "",
                "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
                "",
                "### Two-Weapon Fighting",
                "",
                "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
            ],
            [
                "Spellcasting",
                "By the time you reach 2nd level, you have learned to use the magical essence of nature to cast spells, much as a druid does. See chapter 10 for the general rules of spellcasting and chapter 11 for the ranger spell list.",
                "",
                "### Spell Slots",
                "",
                "The Ranger table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell's level or higher. You regain all expended spell slots when you finish a long rest.",
                "",
                "For example, if you know the 1st-level spell *animal friendship* and have a 1st-level and a 2nd-level spell slot available, you can cast *animal friendship* using either slot.",
                "",
                "### Spells Known of 1st Level and Higher",
                "",
                "You know two 1st-level spells of your choice from the ranger spell list.",
                "",
                "The Spells Known column of the Ranger table shows when you learn more ranger spells of your choice. Each of these spells must be of a level for which you have spell slots. For instance, when you reach 5th level in this class, you can learn one new spell of 1st or 2nd level.",
                "",
                "Additionally, when you gain a level in this class, you can choose one of the ranger spells you know and replace it with another spell from the ranger spell list, which also must be of a level for which you have spell slots.",
                "",
                "### Spellcasting Ability",
                "",
                "Wisdom is your spellcasting ability for your ranger spells, since your magic draws on your attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a ranger spell you cast and when making an attack roll with one.",
                "",
                "**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier",
                "",
                "**Spell attack modifier** = your proficiency bonus + your Wisdom modifier"
            ]
        ],
        [
            3,
            [
                "Primeval Awareness",
                "Beginning at 3rd level, your mastery of ranger lore allows you to establish a powerful link to beasts and to the land around you.",
                "",
                "You have an innate ability to communicate with beasts, and they recognize you as a kindred spirit. Through sounds and gestures, you can communicate simple ideas to a beast as an action, and can read its basic mood and intent. You learn its emotional state, whether it is affected by magic of any sort, its short-term needs (such as food or safety), and actions you can take (if any) to persuade it to not attack.",
                "",
                "You cannot use this ability against a creature that you have attacked within the past 10 minutes.",
                "",
                "Additionally, you can attune your senses to determine if any of your favored enemies lurk nearby. By spending 1 uninterrupted minute in concentration (as if you were concentrating on a spell), you can sense whether any of your favored enemies are present within 5 miles of you. This feature reveals which of your favored enemies are present, their numbers, and the creatures' general direction and distance (in miles) from you.",
                "",
                "If there are multiple groups of your favored enemies within range, you learn this information for each group."
            ],
            [
                "Ranger Conclave",
                "At 3rd level, you choose to emulate the ideals and training of a ranger conclave: the Beast Conclave, the Hunter Conclave, or the Stalker Conclave, all detailed at the end of the class description. Your choice grants you features at 3rd level and again at 5th, 7th, 11th, and 15th level."
            ]
        ],
        [
            4,
            [
                "Ability Score Improvement",
                "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can't increase an ability score above 20 using this feature."
            ]
        ],
        [
            5,
            [
                "Ranger Conclave feature",
                "You gain a feature from your Ranger Conclave."
            ]
        ],
        [
            6,
            [
                "Greater Favored Enemy",
                "At 6th level, you are ready to hunt even deadlier game. Choose a type of greater favored enemy: aberrations, celestials, constructs, dragons, elementals, fiends, or giants. You gain all the benefits against this chosen enemy that you normally gain against your favored enemy, including an additional language. Your bonus to damage rolls against all your favored enemies increases to +4.",
                "",
                "Additionally, you have advantage on saving throws against the spells and abilities used by a greater favored enemy."
            ]
        ],
        [
            7,
            "Ranger Conclave feature"
        ],
        [
            8,
            "Ability Score Improvement",
            [
                "Fleet of Foot",
                "Beginning at 8th level, you can use the Dash action as a bonus action on your turn."
            ]
        ],
        [
            10,
            [
                "Hide in Plain Sight",
                "Starting at 10th level, you can remain perfectly still for long periods of time to set up ambushes.",
                "",
                "When you attempt to hide on your turn, you can opt to not move on that turn. If you avoid moving, creatures that attempt to detect you take a -10 penalty to their Wisdom (Perception) checks until the start of your next turn. You lose this benefit if you move or fall prone, either voluntarily or because of some external effect. You are still automatically detected if any effect or action causes you to no longer be hidden.",
                "",
                "If you are still hidden on your next turn, you can continue to remain motionless and gain this benefit until you are detected."
            ]
        ],
        [
            11,
            "Ranger Conclave feature"
        ],
        [
            12,
            "Ability Score Improvement"
        ],
        [
            14,
            [
                "Vanish",
                "Starting at 14th level, you can use the Hide action as a bonus action on your turn. Also, you can't be tracked by nonmagical means, unless you choose to leave a trail."
            ]
        ],
        [
            15,
            "Ranger Conclave feature"
        ],
        [
            16,
            "Ability Score Improvement"
        ],
        [
            18,
            [
                "Feral Senses",
                "At 18th level, you gain preternatural senses that help you fight creatures you can't see. When you attack a creature you can't see, your inability to see it doesn't impose disadvantage on your attack rolls against it.",
                "",
                "You are also aware of the location of any invisible creature within 30 feet of you, provided that the creature isn't hidden from you and you aren't blinded or deafened."
            ]
        ],
        [
            19,
            "Ability Score Improvement"
        ],
        [
            20,
            [
                "Foe Slayer",
                "At 20th level, you become an unparalleled hunter. Once on each of your turns, you can add your Wisdom modifier to the attack roll or the damage roll of an attack you make. You can choose to use this feature before or after the roll, but before any effects of the roll are applied."
            ]
        ]
    ],
    "hit die": "1d10",
    "long description": [
        "# The Ranger, Revised",
        "",
        "Over the past year, you've seen us try a number of new approaches to the ranger, all aimed at addressing the class's high levels of player dissatisfaction and its ranking as D&D's weakest class by a significant margin.",
        "",
        "Those two factors combined to put us on the path to this revision. We have classes that rate as weak, but which nonetheless have high levels of player satisfaction. That tells us people playing those classes are happy with how their characters' abilities work and with their own experience at the table, even if those classes aren't the strongest. After all, not every class can rank at the top.",
        "",
        "Likewise, most issues we see with classes are confined to specific abilities that don't play a big role in determining whether players like the class as a whole. In other words, no class is perfect, but each is close enough to the mark in its own way that players are happy.",
        "",
        "As such, the ranger's status as a sore spot for players has been a cause for concern for a while. And so, today we present a new revision of the ranger. Though it retains many of the elements of the existing class, a lot has changed, so it's best to simply dig into the new material to get a sense of how it feels. But what I'd like to address here is how the D&D game will evolve in the future.",
        "",
        "Any change as dramatic as rebuilding a character class requires planning, verification, and a clear, easy implementation.",
        "",
        "The planning phase goes back to our review of playtest feedback. We review data and read anecdotes on Reddit, forums, and social media. We try to decide if addressing the issue is worth the potential disruption to the game.",
        "",
        "In this case, we felt that a few factors combined to push for a change. Many players want to play rangers, but few were happy with the class, which held its place at the bottom of class power rankings by a significant margin. The class's individual features also filled the top-ten list of lowest-rated individual character features.",
        "",
        "With our course set for a revision, we've spent the past year experimenting and gathering feedback. We believe that if something doesn't hit the mark the first time, we need to take our time and make sure our path to a solution is the right one. So our tinkering with the ranger led us here, to this latest update.",
        "",
        "Our next step, which begins now, is verification. Are these fixes correct? Do they solve problems at your table? Do you, as the community of D&D players and DMs, accept them? I expect another revision or two to be made to the class, but I'm confident that the scope and direction of these changes fit in with what the community is looking for.",
        "",
        "Finally, we come to implementation. If this iteration of the ranger, or a future revision of it, grades high enough, our plan is to present it as a revised ranger in a future D&D sourcebook. Players can select the original ranger or the revised version, though DMs will always be free to use only one or the other. Both will be legal for D&D Adventurers League play, and players of existing ranger characters will have the option to swap to the revised version. As you'll see as you read further, the original ranger and the revised class use almost identical progression tables, even if the specifics of some features differ. With a little work on our end, we can ensure that any new ranger options we provide work for both classes.",
        "",
        "Overall, this approach captures our intent---fix what needs to be fixed when it's necessary to do so, but in a way that minimizes disruption and maximizes player satisfaction. With that in mind, take a look at our new ranger and keep an eye out for the feedback survey to follow.",
        "",
        "## Ranger Conclaves",
        "",
        "Across the wilds, rangers come together to form conclaves---loose associations whose members share a similar outlook on how best to protect nature from those who would despoil it."
    ],
    "magic": 2,
    "name": "Ranger, Revised",
    "primary stat": [
        "dex",
        "wis"
    ],
    "saving throws": [
        "str",
        "dex"
    ],
    "skills": [
        3,
        "Animal Handling",
        "Athletics",
        "Insight",
        "Investigation",
        "Nature",
        "Perception",
        "Stealth",
        "Survival"
    ],
    "spells": "ranger",
    "table": {
        "@": [
            "Spells Known"
        ],
        "Spells Known": [
            "-",
            "2",
            "3",
            "3",
            "4",
            "4",
            "5",
            "5",
            "6",
            "6",
            "7",
            "7",
            "8",
            "8",
            "9",
            "9",
            "10",
            "10",
            "11",
            "11"
        ]
    }
}
