{
    "+": "MM",
    "ability scores": {
        "cha": 11,
        "con": 15,
        "dex": 15,
        "int": 9,
        "str": 16,
        "wis": 11
    },
    "actions": [
        [
            "Multiattack",
            "The devil makes two attacks: one with its beard and one with its glaive."
        ],
        [
            "Beard",
            "*Melee Weapon Attack:* +5 to hit, reach 5 ft., one creature. *Hit:* 6 (1d8 + 2) piercing damage, and the target must succeed on a DC 12 Constitution saving throw or be poisoned for 1 minute. While poisoned in this way, the target can't regain hit points. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
        ],
        [
            "Glaive",
            "*Melee Weapon Attack:* +5 to hit, reach 10ft., one target. *Hit:* 8 (1d10 + 3) slashing damage. If the target is a creature other than an undead or a construct, it must succeed on a DC 12 Constitution saving throw or lose 5 (1dl0) hit points at the start of each of its turns due to an infernal wound. Each time the devil hits the wounded target with this attack, the damage dealt by the wound increases by 5 (ld10). Any creature can take an action to stanch the wound with a successful DC 12 Wisdom (Medicine) check. The wound also closes if the target receives magical healing."
        ]
    ],
    "alignment": "lawful evil",
    "armor class": "13 (natural armor)",
    "condition immunities": [
        "poisoned"
    ],
    "damage immunities": [
        "fire",
        "poison"
    ],
    "damage resistances": [
        "cold",
        "bludgeoning, piercing, and slashing from nonmagical attacks that aren't silvered"
    ],
    "description": [
        "# Bearded Devil (Barbazu)",
        "",
        "Bearded devils serve archdevils as shock troops, fighting shoulder-to-shoulder and reveling in the glory of battle. They respond with violence to any slight, real or imagined, gorging themselves on violence as their infernal saw-toothed glaives carve a path through their foes.",
        "",
        "A bearded devil is humanoid in form, with pointed ears, scaly skln, a long tail, and claws that clearly show its fiendish nature. These devils take their names from the snakelike growths that adorn their chins, which they use to lash and poison enemies, weakening them with their virulent venom."
    ],
    "experience": 700,
    "group": "Devils",
    "hit points": "52 (8d8 + 16)",
    "languages": [
        "Infernal",
        "telepathy 120 ft."
    ],
    "name": "Bearded Devil",
    "saving throws": {
        "Con": 4,
        "Str": 5,
        "Wis": 2
    },
    "senses": [
        "darkvision 120 ft."
    ],
    "size": "Medium",
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Devil's Sight",
            "Magical darkness doesn't impede the devil's darkvision."
        ],
        [
            "Magic Resistance",
            "The devil has advantage on saving throws against spells and other magical effects."
        ],
        [
            "Steadfast",
            "The devil can't be frightened while it can see an allied creature within 30 feet of it."
        ]
    ],
    "type": "fiend (devil)"
}