{
    "+": "FREE",
    "ability scores": {
        "cha": 11,
        "con": 14,
        "dex": 14,
        "int": 9,
        "str": 18,
        "wis": 13
    },
    "actions": [
        [
            "Multiattack",
            "The centaur makes two attacks: one with its pike and one with its hooves or two with its longbow."
        ],
        [
            "Pike",
            "*Melee Weapon Attack:* +6 to hit, reach 10ft., one target. *Hit:* 9 (1d10 + 4) piercing damage."
        ],
        [
            "Hooves",
            "*Melee Weapon Attack:* +6 to hit, reach 5 ft., one target. *Hit:* 11 (2d6 + 4) bludgeoning damage."
        ],
        [
            "Longbow",
            "*Ranged Weapon Attack:* +4 to hit, range 150/600 ft., one target. *Hit:* 6 (1d8 + 2) piercing damage."
        ]
    ],
    "alignment": "neutral good",
    "armor class": "12",
    "description": [
        "> \"I hear centaurs make excellent mounts!\"",
        ">",
        "> --Batley Summerfoot, a halfling adventurer who never read HOOVES OF FURY, by Irvil Grayborn of Sundown",
        "",
        "Reclusive wanderers and omen-readers of the wild, centaurs avoid conflict but fight fiercely when pressed. They roam the vast wilderness, keeping far from borders, laws, and the company of other creatures.",
        "",
        "***Wilderness Nomads.*** Centaur tribes range across lands with mild to hot climates, where a centaur requires only light furs or oiled skins to deal with inclement weather. They are hunter-gatherers and rarely build shelters or even use tents.",
        "",
        "Centaur migrations span continents and take decades to repeat, so that a centaur tribe might not retread the same path for generations. These long-ranging patterns can lead to conflict when centaurs encounter settlements of other creatures built along their traditional routes.",
        "",
        "***Reluctant Settlers.*** A centaur that can't keep pace with the rest of its tribe is left behind. Some such centaurs vanish into the wilderness and are never seen again. Those that can bear the loss of their tribe might take up residence among other races. Frontier settlements value the nature knowledge of their centaur residents. Many such communities owe their survival to the insight and acumen of a centaur.",
        "",
        "Despite their reclusive nature, centaurs trade with elves and with the caravans of other benevolent humanoids they meet during their wanderings. A trader might save the life of a wounded or an elderly centaur unfit for long travel, escorting it to a settlement where it can peacefully live out the rest of its days."
    ],
    "experience": 450,
    "hit points": "45 (6d10 + 12)",
    "languages": [
        "Elvish",
        "Sylvan"
    ],
    "name": "Centaur",
    "size": "Large",
    "skills": {
        "Athletics": 6,
        "Perception": 3,
        "Survival": 3
    },
    "speed": [
        "50 ft."
    ],
    "traits": [
        [
            "Charge",
            "If the centaur moves at least 30 feet straight toward a target and then hits it with a pike attack on the same turn, the target takes an extra 10 (3d6) piercing damage."
        ]
    ],
    "type": "monstrosity"
}