{
    "+": "MM",
    "ability scores": {
        "cha": 16,
        "con": 24,
        "dex": 12,
        "int": 16,
        "str": 22,
        "wis": 15
    },
    "actions": [
        [
            "Multiattack",
            "The efreeti makes two scimitar attacks or uses its Hurl Flame twice."
        ],
        [
            "Scimitar",
            "*Melee Weapon Attack:* +10 to hit, reach 5 ft., one target. *Hit:* 13 (2d6 + 6) slashing damage plus 7 (2d6) fire damage."
        ],
        [
            "Hurl Flame",
            "*Ranged Spell Attack:* +7 to hit, range 120 ft., one target. *Hit:* 17 (5d6) fire damage."
        ]
    ],
    "alignment": "lawful evil",
    "armor class": "17 (natural armor)",
    "damage immunities": [
        "fire"
    ],
    "description": [
        "Hulking genies of the Elemental Plane of Fire, the efreet are masters of flame, immune to fire and able to create it on a whim. Fine silk caftans and damask robes drape their magma-red or coal-black skin, and they bedeck themselves in brass and gold torcs, chains, and rings, all glittering with jewels. When an efreeti flies, its lower body transforms into a column of smoke and embers.",
        "",
        "***Haughty and Cruel.*** The efreet are deceptive, cunning, and cruel to the point of ruthlessness. They despise being forced into servitude and are relentless in pursuit of vengeance against creatures that have wronged them. Efreet don't see themselves in this light, naturally, and regard their race as fair and orderly, even as they admit to an enlightened sense of self-interest.",
        "",
        "***Spiteful Slavers.*** Efreet view all other creatures as enemies or potential serfs. They raid the Material Plane and the elemental planes for slaves, which they capture and bring back to their homes on the Elemental Plane of Fire. The efreet rule as oppressive tyrants, promoting only the cruelest among their slaves. Those overseers are given whips to help keep the rank-and-file slaves in line.",
        "",
        "***Planar Raiders.*** Most efreet reside on the Elemental Plane of Fire, either in great domed fortresses of black glass and basalt surrounded by churning lakes of fire, or in the fabled City of Brass. Additionally, efreet military outposts thronging with their minions and slaves can be found scattered throughout the planes.",
        "",
        "On the Material Plane, efreet dwell in fiery regions such as volcanoes and the burning expanses of the world's deserts. Their love of the desert brings them into conflict with the djinn that ride the desert whirlwinds, and with the earthbound dao. Efreet utterly despise marids, with whom they have maintained a passionate conflict throughout the history of both races.",
        "",
        "> \"The armies of the Grand Sultan are bolstered by legions of devils, his palace warded by the spells of a thousand archmagi, his treasures guarded by red dragons and fire elementals. No one has plundered  the efreeti's fabled vaults and lived to tell the tale. By the grace of a thousand winds, you could be the first.\"",
        ">",
        "> --A djinni enticing adventurers to free her caliph from a magic lamp in the Charcoal Palace of the City of Brass"
    ],
    "experience": 7200,
    "group": "Genies",
    "hit points": "200 (16d10 + 112)",
    "languages": [
        "Ignan"
    ],
    "name": "Efreeti",
    "saving throws": {
        "Cha": 7,
        "Int": 7,
        "Wis": 6
    },
    "senses": [
        "darkvision 120 ft."
    ],
    "size": "Large",
    "speed": [
        "40 ft.",
        "fly 60 ft."
    ],
    "traits": [
        [
            "Elemental Demise",
            "If the efreeti dies, its body disintegrates in a flash of fire and puff of smoke, leaving behind only equipment the efreeti was wearing or carrying."
        ],
        [
            "Innate Spellcasting",
            "The efreeti's innate spellcasting ability is Charisma (spell save DC 15, +7 to hit with spell attacks). It can innately cast the following spells, requiring no material components:",
            "",
            "At will: *detect magic*",
            "",
            "3/day: *enlarge/reduce*, *tongues*",
            "",
            "1/day each: *conjure elemental* (fire elemental only), *gaseous form*, *invisibility*, *major image*, *plane shift*, *wall of fire*",
            "",
            "<spell>Detect Magic</spell>",
            "",
            "<spell>Enlarge/Reduce</spell>",
            "",
            "<spell>Tongues</spell>",
            "",
            "<spell>Conjure Elemental</spell>",
            "",
            "<spell>Gaseous Form</spell>",
            "",
            "<spell>Invisibility</spell>",
            "",
            "<spell>Major Image</spell>",
            "",
            "<spell>Plane Shift</spell>",
            "",
            "<spell>Wall of Fire</spell>"
        ]
    ],
    "type": "elemental"
}