{
    "+": "FREE",
    "ability scores": {
        "cha": 5,
        "con": 18,
        "dex": 9,
        "int": 6,
        "str": 19,
        "wis": 10
    },
    "actions": [
        [
            "Multiattack",
            "The golem makes two slam attacks."
        ],
        [
            "Slam",
            "*Melee Weapon Attack:* +7 to hit, reach 5 ft., one target. *Hit:* 13 (2d8 + 4) bludgeoning damage."
        ]
    ],
    "alignment": "neutral",
    "armor class": "9",
    "condition immunities": [
        "charmed",
        "exhaustion",
        "frightened",
        "paralyzed",
        "petrified",
        "poisoned"
    ],
    "damage immunities": [
        "lightning",
        "poison",
        "bludgeoning, piercing, and slashing from nonmagical attacks that aren't adamantine"
    ],
    "description": [
        "A flesh golem is a grisly assortment of humanoid body parts stitched and bolted together into a muscled brute imbued with formidable strength. Its brain is capable of simple reason, though its thoughts are no more sophisticated than those of a young child. The golem's muscle tissue responds to the power of lightning, invigorating the creature with vitality and strength. Powerful enchantments protect the golem's skin, deflecting spells and all but the most potent weapons.",
        "",
        "A flesh golem lurches with a stiff-jointed gait, as if not in complete control of its body. Its dead flesh isn't an ideal container for an elemental spirit, which sometimes howls incoherently to vent its outrage. If the spirit breaks free of its creator's will, the golem goes berserk until calmed, or until its shell of flesh is destroyed or completely healed.",
        "",
        "> \"Two of my gravediggers were caught and hanged yesterday. The other two are understandably reluctant to meet a similar fate, but I shan't let their concerns stall my progress. I need fresh corpses, and if those bumpkins can't get them for me, I'll use theirs instead.\"",
        ">",
        "> --From the Diary of Evangeliza Lavain, necromancer"
    ],
    "experience": 1800,
    "group": "Golems",
    "hit points": "93 (11d8 + 44)",
    "languages": [
        "understands the languages of its creator but can't speak"
    ],
    "name": "Flesh Golem",
    "senses": [
        "darkvision 60 ft."
    ],
    "size": "Medium",
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Berserk",
            "Whenever the golem starts its turn with 40 hit points or fewer, roll a d6. On a 6, the golem goes berserk. On each of its turns while berserk, the golem attacks the nearest creature it can see. If no creature is near enough to move to and attack, the golem attacks an object, with preference for an object smaller than itself. Once the golem goes berserk, it continues to do so until it is destroyed or regains all its hit points.",
            "",
            "The golem's creator, if within 60 feet of the berserk golem, can try to calm it by speaking firmly and persuasively. The golem must be able to hear its creator, who must take an action to make a DC 15 Charisma (Persuasion) check. If the check succeeds, the golem ceases being berserk. If it takes damage while still at 40 hit points or fewer, the golem might go berserk again."
        ],
        [
            "Aversion of Fire",
            "If the golem takes fire damage, it has disadvantage on attack rolls and ability checks until the end of its next turn."
        ],
        [
            "Immutable Form",
            "The golem is immune to any spell or effect that would alter its form."
        ],
        [
            "Lightning Absorption",
            "Whenever the golem is subjected to lightning damage, it takes no damage and instead regains a number of hit points equal to the lightning damage dealt."
        ],
        [
            "Magic Resistance",
            "The golem has advantage on saving throws against spells and other magical effects."
        ],
        [
            "Magic Weapons",
            "The golem's weapon attacks are magical."
        ]
    ],
    "type": "construct"
}