{
    "+": "FREE",
    "ability scores": {
        "cha": 4,
        "con": 11,
        "dex": 15,
        "int": 2,
        "str": 7,
        "wis": 10
    },
    "actions": [
        [
            "Bite",
            "*Melee Weapon Attack:* +4 to hit, reach 5 ft., one target. Hit: 4 (1d4 + 2) piercing damage."
        ]
    ],
    "alignment": "unaligned",
    "armor class": "12",
    "description": [
        "> **Notice**",
        ">",
        "> Giant rats have been sighted throughout the city. Anyone bitten by a giant rat should visit a temple for ministration and prayer.",
        ">",
        "> The city hereby offers a silver coin for each giant rat slain within its walls. To recieve payment, evidence must be delivered to the watch captain at the docks between highsun and dusk.",
        "",
        "<!---->",
        "",
        "> **Variant: Diseased Giant Rats**",
        ">",
        "> Some giant rats carry vile diseases that they spread with their I bites. A diseased giant rat has a challenge rating of 1/8 (25 XP) and the following action instead of its normal bite attack.",
        ">",
        "> ***Bite.*** *Melee Weapon Attack:* +4 to hit, reach 5 ft., one target. *Hit:* 4 (1d4 + 2) piercing damage. If the target is a creature, it must succeed on a DC 10 Constitution saving throw or contract a disease. Until the disease is cured, the target can't regain hit points except by magical means, and the target's hit point maximum decreases by 3 (1d6) every 24 hours. If the target's hit point maximum drops to 0 as a result ofthis disease, the target dies."
    ],
    "experience": 25,
    "hit points": "7 (2d6)",
    "name": "Giant Rat",
    "senses": [
        "darkvision 60 ft."
    ],
    "size": "Small",
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Keen Smell",
            "The rat has advantage on Wisdom (Perception) checks that rely on smell."
        ],
        [
            "Pack Tactics",
            "The rat has advantage on an attack roll against a creature if at least one of the rat's allies is within 5 feet of the creature and the ally isn't incapacitated."
        ]
    ],
    "type": "beast"
}