{
    "+": "PotA",
    "ability scores": {
        "cha": 11,
        "con": 10,
        "dex": 15,
        "int": 10,
        "str": 10,
        "wis": 9
    },
    "actions": [
        [
            "Dagger",
            "*Melee or Ranged Weapon Attack:* +4 to hit, reach 5 ft. or range 20/60 ft., one target. *Hit:* 4 (1d4 + 2) piercing damage."
        ]
    ],
    "alignment": "neutral evil",
    "armor class": "13 (leather)",
    "description": [
        "*Princes of the Apocalypse*",
        "",
        "Howling Hatred initiates are attracted by the cult's philosophy of non-attachment and the rejection of material things, unaware of the cult's true nature. The cult attracts adherents of all kinds, from dreamy-eyed youths with little property to world-weary folk eager to put their faith in something as tangible and powerful as an elemental force.",
        "",
        "Initiates live on little but air for a month, believing that this regimen purifies them of bodily needs. In truth it makes their bodies so desperate for sustenance that they become susceptible to indoctrination. Soon, they can justify heinous acts within the context of the cult: Human sacrifice isn't an act of murder, but a freeing of the soul from the limitations of a physical shell; conjuring a whirlwind to destroy unbelievers isn't an act of terror but a demonstration of true faith."
    ],
    "experience": 25,
    "group": "Howling Hatred Cultists",
    "hit points": "9 (2d8)",
    "languages": [
        "Common"
    ],
    "name": "Howling Hatred Initiate",
    "size": "Medium",
    "skills": {
        "Deception": 2,
        "Religion": 2,
        "Stealth": 4
    },
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Guiding Wind (Recharges after a Short or Long Rest)",
            "As a bonus action, the initiate gains advantage on the next ranged attack roll it makes before the end of its next turn."
        ],
        [
            "Hold Breath",
            "The initiate can hold its breath for 30 minutes."
        ]
    ],
    "type": "humanoid (human)"
}
