{
    "+": "MM",
    "ability scores": {
        "cha": 15,
        "con": 19,
        "dex": 11,
        "int": 12,
        "str": 20,
        "wis": 10
    },
    "actions": [
        [
            "Multiattack",
            "The nycaloth makes two melee attacks, or it makes one melee attack and teleports before or after the attack."
        ],
        [
            "Claw",
            "*Melee Weapon Attack:* +9 to hit, reach 5 ft., one target. *Hit:* 12 (2d6 + 5) slashing damage. If the target is a creature, it must succeed on a DC 16 Constitution saving throw or take 5 (2d4) slashing damage at the start of each of its turns due to a fiendish wound. Each time the nycaloth hits the wounded target with this attack, the damage dealt by the wound increases by 5 (2d4). Any creature can take an action to stanch the wound with a successful DC 13 Wisdom (Medicine) check. The wound also closes if the target receives magical healing."
        ],
        [
            "Greataxe",
            "*Melee Weapon Attack:* +9 to hit, reach 5 ft., one target. *Hit:* 18 (2d12 + 5) slashing damage."
        ],
        [
            "Teleport",
            "The nycaloth magically teleports, along with any equipment it is wearing or carrying, up to 60 feet to an unoccupied space it can see."
        ]
    ],
    "alignment": "neutral evil",
    "armor class": "18 (natural armor)",
    "condition immunities": [
        "poisoned"
    ],
    "damage immunities": [
        "acid",
        "poison"
    ],
    "damage resistances": [
        "cold",
        "fire",
        "lightning",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "description": [
        "The elite airborne shock troops of the yugoloths, nycaloths look like muscular gargoyles. Powerful bat wings bear them swiftly aloft in battle, and the razor-sharp claws of their hands and feet cut through flesh and bone with ease. A nightmarish foe, a nycaloth strikes hard and fast without warning, then teleports away. It uses its innate magic to turn invisible or create illusory doubles of itself, further confounding its enemies.",
        "",
        "Nycaloths are the most loyal of the yugoloths. When they find an evil master that treats them well, they are unlikely to break their agreement unless the reward for doing so is extreme."
    ],
    "experience": 5000,
    "group": "Yugoloths",
    "hit points": "123 (13d10 + 52)",
    "languages": [
        "Abyssal",
        "Infernal",
        "telepathy 60 ft."
    ],
    "name": "Nycaloth",
    "senses": [
        "blindsight 60 ft.",
        "darkvision 60 ft."
    ],
    "size": "Large",
    "skills": {
        "Intimidation": 6,
        "Perception": 4,
        "Stealth": 4
    },
    "speed": [
        "40 ft.",
        "fly 60 ft."
    ],
    "traits": [
        [
            "Innate Spellcasting",
            "The nycaloth's innate spellcasting ability is Charisma. The nycaloth can innately cast the following spells, requiring no material components:",
            "",
            "At will: *darkness*, *detect magic*, *dispel magic*, *invisibility* (self only), *mirror image*",
            "",
            "<spell>Darkness</spell>",
            "",
            "<spell>Detect Magic</spell>",
            "",
            "<spell>Dispel Magic</spell>",
            "",
            "<spell>Invisibility</spell>",
            "",
            "<spell>Mirror Image</spell>"
        ],
        [
            "Magic Resistance",
            "The nycaloth has advantage on saving throws against spells and other magical effects."
        ],
        [
            "Magic Weapons",
            "The nycaloth's weapon attacks are magical."
        ]
    ],
    "type": "fiend (yugoloth)"
}