{
    "+": "MM",
    "ability scores": {
        "cha": 15,
        "con": 16,
        "dex": 11,
        "int": 14,
        "str": 19,
        "wis": 12
    },
    "actions": [
        [
            "Multiattack",
            "The oni makes two attacks, either with its claws or its glaive."
        ],
        [
            "Claw (Oni Form Only)",
            "*Melee Weapon Attack:* +7 to hit, reach 5 ft., one target. *Hit:* 8 (1d8 + 4) slashing damage."
        ],
        [
            "Glaive",
            "*Melee Weapon Attack:* +7 to hit, reach 10 ft., one target. *Hit:* 15 (2d10 + 4) slashing damage, or 9 (1d10 + 4) slashing damage in Small or Medium form."
        ],
        [
            "Change Shape",
            "The oni magically polymorphs into a Small or Medium humanoid, into a Large giant, or back into its true form. Other than its size, its statistics are the same in each form. The only equipment that is transformed is its glaive, which shrinks so that it can be wielded in humanoid form. If the oni dies, it reverts to its true form, and its glaive reverts to its normal size."
        ]
    ],
    "alignment": "lawful evil",
    "armor class": "16 (chain mail)",
    "description": [
        "In nursery rhymes, oni are fearsome bogeymen that haunt the nightmares of children and adults alike, yet they are very real and always hungry. They find human babies especially delicious. Oni look like demonic ogres with blue or green skin, dark hair, and a pair of short ivory horns protruding from their foreheads. Their eyes are dark with strikingly white pupils, and their teeth and claws are jet black.",
        "",
        "***Night Haunters.*** By the light of day, an oni hides its true form with magic, gaining the trust of those it intends to betray when darkness descends. These creatures can change their size as well as their shape, appearing as humanoids as they pass through towns, pretending to be travelers, woodcutters, or frontier folk. In such a form, an oni takes stock of the selection of humanoids in a settlement and devises ways to abduct and devour some of them.",
        "",
        "***Magical Ogres.*** Oni are sometimes called ogre mages because of their innate magical ability. Though they are only distantly related to true ogres, they share the ogres' habit of joining forces with other evil creatures. An oni serves a master if doing so proves lucrative or provides it with a luxurious, well-defended home. Oni covet magic, and they work for evil wizards and hags in exchange for useful magic items.",
        "",
        "> Lock the door, blow out the light;  ",
        "> The hungry oni haunts the night.  ",
        "> Hide and tremble, little one;  ",
        "> The oni wants to have some fun.",
        ">",
        "> Hear it scratching on the door;  ",
        "> See its shadow cross the floor.  ",
        "> The sun won't rise for quite a while;  ",
        "> Till then, beware the oni's smile.",
        ">",
        "> --Children's rhyme"
    ],
    "experience": 2900,
    "hit points": "110 (13d10 + 39)",
    "languages": [
        "Common",
        "Giant"
    ],
    "name": "Oni",
    "saving throws": {
        "Cha": 5,
        "Con": 6,
        "Dex": 3,
        "Wis": 4
    },
    "senses": [
        "darkvision 60 ft."
    ],
    "size": "Large",
    "skills": {
        "Arcana": 5,
        "Deception": 8,
        "Perception": 4
    },
    "speed": [
        "30 ft.",
        "fly 30 ft."
    ],
    "traits": [
        [
            "Innate Spellcasting",
            "The oni's innate spellcasting ability is Charisma (spell save DC 13). The oni can innately cast the following spells, requiring no material components:",
            "",
            "At will: *darkness*, *invisibility*",
            "",
            "1/day each: *charm person*, *cone of cold*, *gaseous form*, *sleep*",
            "",
            "<spell>Darkness</spell>",
            "",
            "<spell>Invisibility</spell>",
            "",
            "<spell>Charm Person</spell>",
            "",
            "<spell>Cone of Cold</spell>",
            "",
            "<spell>Gaseous Form</spell>",
            "",
            "<spell>Sleep</spell>"
        ],
        [
            "Magic Weapons",
            "The oni's weapon attacks are magical."
        ],
        [
            "Regeneration",
            "The oni regains 10 hit points at the start of its turn if it has at least 1 hit point."
        ]
    ],
    "type": "giant"
}