{
    "+": "MM",
    "ability scores": {
        "cha": 16,
        "con": 18,
        "dex": 12,
        "int": 11,
        "str": 18,
        "wis": 11
    },
    "actions": [
        [
            "Multiattack",
            "The orc makes two attacks with its greataxe or its spear."
        ],
        [
            "Greataxe",
            "*Melee Weapon Attack:* +6 to hit, reach 5 ft., one target. *Hit:* 15 (1d12 + 4 plus 1d8) slashing damage."
        ],
        [
            "Spear",
            "*Melee or Ranged Weapon Attack:* +6 to hit, reach 5 ft. or range 20/60 ft., one target. *Hit:* 12 (1d6 + 4 plus 1d8) piercing damage, or 13 (2d8 + 4) piercing damage if used with two hands to make a melee attack."
        ],
        [
            "Battle Cry (1/Day)",
            "Each creature of the war chief's choice that is within 30 feet of it, can hear it, and not already affected by Battle Cry gain advantage on attack rolls until the start of the war chief's next turn. The war chief can then make one attack as a bonus action."
        ]
    ],
    "alignment": "chaotic evil",
    "armor class": "16 (chain mail)",
    "description": [
        "The war chief of an orc tribe is its strongest and most cunning member. The reign of a war chief lasts only as long as it commands the fear and respect of other tribe members, whose bloodlust must be regularly satisfied lest the chief appear weak.",
        "",
        "***Scions of Slaughter.*** Gruumsh bestows special blessings upon war chiefs who prove themselves in battle time and again, imbuing them with slivers of his savagery. A war chief so blessed finds that his weapons cut deeper into his enemies, allowing him to inflict more carnage.",
        "",
        "> **King Obould Many-Arrows",
        ">",
        "> King Obould of the Many-Arrows tribe is a legend among the ore war chiefs of the Forgotten Realms, and he is the most famous ore chief in the history of the D&D game.",
        ">",
        "> Smarter and more intuitive than most of his kind, Obould slew his chieftain to take control of his tribe. Skilled in the arts of war and renowned for his violent temper, Obould proved himself a fierce opponent in battle time and again. Over the years, he subsumed other ore tribes into his own until he commanded a horde of thousands.",
        ">",
        "> Obould leveraged his strength and influence to carve out a kingdom for himself in the Spine of the World, a mountain range overlooking numerous dwarven, human, and elven strongholds.",
        ">",
        "> After years of bloody conflict with his more civilized neighbors, Obould did the unthinkable and brokered a peace treaty with his enemies. This treaty confused many of the orcs under Obould's command. It was either a clever ploy by Obould to buy time while he strengthened his army for a final, decisive sweep across the Savage Frontier, or it was a troubling sign that Obould had forsaken the ways of Gruumsh and needed to be destroyed."
    ],
    "experience": 1100,
    "group": "Orcs",
    "hit points": "93 (11d8 + 44)",
    "languages": [
        "Common",
        "Orc"
    ],
    "name": "Orc War Chief",
    "saving throws": {
        "Con": 6,
        "Str": 6,
        "Wis": 2
    },
    "senses": [
        "darkvision 60 ft."
    ],
    "size": "Medium",
    "skills": {
        "Intimidation": 5
    },
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Aggressive",
            "As a bonus action, the orc can move up to its speed toward a hostile creature that it can see."
        ],
        [
            "Gruumsh's Fury",
            "The orc deals an extra 4 (1d8) damage when it hits with a weapon attack (included in the attacks)."
        ]
    ],
    "type": "humanoid (orc)"
}