{
    "+": "FREE",
    "ability scores": {
        "cha": 13,
        "con": 16,
        "dex": 15,
        "int": 10,
        "str": 18,
        "wis": 15
    },
    "actions": [
        [
            "Hooves",
            "*Melee Weapon Attack:* +6 to hit, reach 5 ft., one target. *Hit:* 11 (2d6 + 4) bludgeoning damage."
        ]
    ],
    "alignment": "chaotic good",
    "armor class": "12",
    "description": [
        "> \"Behold, the pegasus. It can outrace a dragon in the open sky, and only the best among us can ever hope to ride one. A fitting emblem for our great house, don't you think?\"",
        ">",
        "> --Tyllenvane d'Orien, dragonmarked scion and proud representative of House Orien",
        "",
        "The white winged horses known as pegasi soar through the skies, a vision of grace and majesty. When they touch down on solid ground, they linger only for a moment, drinking from mountain springs and pristine lakes. Any sound or sign of another creature startles them, sending them off to fly once more among the clouds.",
        "",
        "***Noble Mounts.*** Pegasi are highly prized as swift and reliable steeds, being faster and less temperamental than griffons, hippogriffs, and wyverns. However, these wild and shy creatures are as intelligent as humanoids, and so can't be traditionally broken and tamed. A pegasus must be persuaded to serve a good-aligned creature as a mount, but when it does so, it forges a lifelong bond with its new companion.",
        "",
        "***Born of the Planes.*** Pegasi trace their origins to the Olympian Glades of Arborea, where they soar through the skies of that plane and serve as faithful mounts to the Seldarine, the pantheon of elven gods. These gods have been known to send pegasi to the Material Plane to aid those in need.",
        "",
        "***Pegasi Nests.*** Pegasi mate for life, build their nests in hard-to-reach locations, and give birth to live young."
    ],
    "experience": 450,
    "hit points": "59 (7d10 + 21)",
    "languages": [
        "understands Celestial, Common, Elvish, and Sylvan but can't speak"
    ],
    "name": "Pegasus",
    "saving throws": {
        "Cha": 3,
        "Dex": 4,
        "Wis": 4
    },
    "size": "Large",
    "skills": {
        "Perception": 6
    },
    "speed": [
        "60 ft.",
        "fly 90 ft."
    ],
    "type": "celestial"
}