{
    "+": "PHB",
    "ability scores": {
        "cha": 10,
        "con": 10,
        "dex": 17,
        "int": 7,
        "str": 5,
        "wis": 10
    },
    "actions": [
        [
            "Claws (Bite in Beast Form)",
            "*Melee Weapon Attack:* +4 to hit, reach 5 ft., one target. *Hit:* 5 (1d4 + 3) piercing damage, and the target must succeed on a DC 10 Constitution saving throw or take 5 (2d4) poison damage and become poisoned for 1 minute. The target can repeat the saving throw at the end of each of its turns, ending the effect on itself on a success."
        ],
        [
            "Scare (1/day)",
            "One creature of the quasit's choice within 20 feet of it must succeed on a DC 10 Wisdom saving throw or be frightened for 1 minute. The target can repeat the saving throw at the end of each of its turns, with disadvantage if the quasit is within line of sight, ending the effect on itself on a success."
        ],
        [
            "Invisibility",
            "The quasit magically turns invisible until it attacks or uses Scare, or until its concentration ends (as if concentrating on a spell). Any equipment the quasit wears or carries is invisible with it."
        ]
    ],
    "alignment": "chaotic evil",
    "armor class": "13",
    "condition immunities": [
        "poisoned"
    ],
    "damage immunities": [
        "poison"
    ],
    "damage resistances": [
        "cold",
        "fire",
        "lightning",
        "bludgeoning, piercing, and slashing from nonmagical attacks"
    ],
    "description": [
        "Quasits infest the Lower Planes. Physically weak, they keep to the shadows to plot mischief and wickedness. More powerful demons use quasits as spies and messengers when they aren't devouring them or pulling them apart to pass the time.",
        "",
        "A quasit can assume animal forms, but in its true form it looks like a 2-foot-tall green humanoid with a barbed tail and horns. The quasit has clawed fingers and toes, and these claws can deliver an irritating poison. It prefers to be invisible when it attacks.",
        "",
        "> **Variant: Quasit Familiar**",
        ">",
        "> Mortal spellcasters interested in extraplanar familiars find quasits easy to summon and eager to serve. The quasit plays the part of the obsequious servant. It serves its master well, but it goads the mortal to greater and greater acts of chaos and evil. Such quasits have the following trait.",
        ">",
        "> ***Familiar.*** The quasit can serve another creature as a familiar, forming a telepathic bond with its willing master. While the two are bonded, the master can sense what the quasit senses as long as they are within 1 mile of each other. While the quasit is within 10 feet of its master, the master shares the quasit's Magic Resistance trait. At any time and for any reason, the quasit can end its service as a familiar, ending the telepathic bond."
    ],
    "experience": 200,
    "group": "Demons",
    "hit points": "7 (3d4)",
    "languages": [
        "Abyssal",
        "Common"
    ],
    "name": "Quasit",
    "senses": [
        "darkvision 120 ft."
    ],
    "size": "Tiny",
    "skills": {
        "Stealth": 5
    },
    "speed": [
        "40 ft."
    ],
    "traits": [
        [
            "Shapechanger",
            "The quasit can use its action to polymorph into a beast form that resembles a bat (speed 10ft. fly 40ft.), a centipede (40ft., climb 40ft.), or a toad (40ft., swim 40ft.), or back into its true form. Its statistics are the same in each form, except for the speed changes noted. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
        ],
        [
            "Magic Resistance",
            "The quasit has advantage on saving throws against spells and other magical effects."
        ]
    ],
    "type": "fiend (demon, shapechanger)"
}