{
    "+": "MM",
    "ability scores": {
        "cha": 7,
        "con": 16,
        "dex": 12,
        "int": 6,
        "str": 16,
        "wis": 6
    },
    "actions": [
        [
            "Multiattack",
            "The slaad makes three attacks: one with its bite and two with its claws."
        ],
        [
            "Bite",
            "*Melee Weapon Attack:* +6 to hit, reach 5 ft., one target. *Hit:* 8 (2d4 + 3) piercing damage."
        ],
        [
            "Claw",
            "*Melee Weapon Attack:* +6 to hit, reach 5 ft., one target. *Hit:* 7 (1d8 + 3) piercing damage. If the target is a humanoid, it must succeed on a DC 14 Constitution saving throw or be infected with a disease - a minuscule slaad egg.",
            "",
            "A humanoid host can carry only one slaad egg to term at a time. Over three months, the egg moves to the chest cavity, gestates, and forms a slaad tadpole. In the 24-hour period before giving birth, the host starts to feel unwell, its speed is halved, and it has disadvantage on attack rolls, ability checks, and saving throws. At birth, the tadpole chews its way through vital organs and out of the host's chest in 1 round, killing the host in the process.",
            "",
            "If the disease is cured before the tadpole's emergence, the unborn slaad is disintegrated."
        ]
    ],
    "alignment": "chaotic neutral",
    "armor class": "14 (natural armor)",
    "damage resistances": [
        "acid",
        "cold",
        "fire",
        "lightning",
        "thunder"
    ],
    "description": [
        "When a red slaad claws a humanoid creature, it can inject an egg from a gland under one of its claws. The egg works its way into its host and gestates, eventually forming a slaad tadpole. Such a tadpole then eats its way out of the host's body, feeds on the host's remains, and then seeks any other fresh meat it can find. The tadpole transforms into a fully grown blue slaad - or green slaad if the host had the ability to cast 3rd level spells or higher - within 2d12 hours."
    ],
    "experience": 1800,
    "group": "Slaadi",
    "hit points": "93 (11d10 + 33)",
    "languages": [
        "Slaad",
        "telepathy 60 ft."
    ],
    "name": "Red Slaad",
    "senses": [
        "darkvision 60 ft."
    ],
    "size": "Large",
    "skills": {
        "Perception": 1
    },
    "speed": [
        "30 ft."
    ],
    "traits": [
        [
            "Magic Resistance",
            "The slaad has advantage on saving throws against spells and other magical effects."
        ],
        [
            "Regeneration",
            "The slaad regains 10 hit points at the start of its turn if it has at least 1 hit point."
        ]
    ],
    "type": "aberration"
}