{
    "+": "MM",
    "ability scores": {
        "cha": 1,
        "con": 10,
        "dex": 14,
        "int": 1,
        "str": 17,
        "wis": 3
    },
    "actions": [
        [
            "Smother",
            "*Melee Weapon Attack:* +5 to hit, reach 5 ft., one Medium or smaller creature. *Hit:* The creature is grappled (escape DC 13). Until this grapple ends, the target is restrained, blinded, and at risk of suffocating, and the rug can't smother another target. In addition, at the start of each of the target's turns, the target takes 10 (2d6 + 3) bludgeoning damage."
        ]
    ],
    "armor class": "12",
    "condition immunities": [
        "blinded",
        "charmed",
        "deafened",
        "frightened",
        "paralyzed",
        "petrified",
        "poisoned"
    ],
    "damage immunities": [
        "poison",
        "psychic"
    ],
    "description": [
        "Would-be thieves and careless heroes arrive at the doorsteps of an enemy's abode, eyes and ears alert for traps, only to end their quest prematurely as the rugs beneath their feet animate and smother them to death.",
        "",
        "A rug of smothering can be made in many different forms, from a finely woven carpet fit for a queen to a coarse mat in a peasant's hovel. Creatures with the ability to sense magic detect the rug's false magical aura.",
        "",
        "In some cases, a rug of smothering is disguised as a *carpet of flying* or another beneficial magic item. However, a character who stands or sits on the rug, or who attempts to utter a word of command, is quickly trapped as the rug of smothering rolls itself tightly around its victim."
    ],
    "experience": 450,
    "group": "Animated Objects",
    "hit points": "33 (6d10)",
    "name": "Rug of Smothering",
    "senses": [
        "blindsight 60 ft. (blind beyond this radius)"
    ],
    "size": "Large",
    "speed": [
        "10 ft."
    ],
    "traits": [
        [
            "Antimagic Susceptibility",
            "The rug is incapacitated while in the area of an *antimagic field*. If targeted by *dispel magic*, the rug must succeed on a Constitution saving throw against the caster's spell save DC or fall unconscious for 1 minute."
        ],
        [
            "Damage Transfer",
            "While it is grappling a creature, the rug takes only half the damage dealt to it, and the creature grappled by the rug takes the other half."
        ],
        [
            "False Appearance",
            "While the rug remains motionless, it is indistinguishable from a normal rug."
        ]
    ],
    "type": "construct"
}