{
    "+": "MM",
    "ability scores": {
        "cha": 3,
        "con": 14,
        "dex": 8,
        "int": 5,
        "str": 15,
        "wis": 10
    },
    "actions": [
        [
            "Constrict",
            "*Melee Weapon Attack:* +4 to hit, reach 10ft., one target. *Hit:* 9 (2d6 + 2) bludgeoning damage, and a Large or smaller target is grappled (escape DC 12). Until this grapple ends, the target is restrained, and the blight can't constrict another target."
        ],
        [
            "Entangling Plants (Recharge 5-6)",
            "Grasping roots and vines sprout in a 15-foot radius centered on the blight, withering away after 1 minute. For the duration, that area is difficult terrain for nonplant creatures. In addition, each creature of the blight's choice in that area when the plants appear must succeed on a DC 12 Strength saving throw or become restrained. A creature can use its action to make a DC 12 Strength check, freeing itself or another entangled creature within reach on a success."
        ]
    ],
    "alignment": "neutral evil",
    "armor class": "12 (natural armor)",
    "condition immunities": [
        "blinded",
        "deafened"
    ],
    "description": [
        "Appearing as masses of slithering creepers, vine blights hide in undergrowth and wait for prey to draw near. By animating the plants around them, vine blights entangle and hinder their foes before attacking.",
        "",
        "Vine blights are the only blights capable of speech. Through its connection to the evil spirit of the Gulthias tree it serves, a vine blight speaks in a fractured version of its dead master's voice, taunting victims or bargaining with powerful foes."
    ],
    "experience": 100,
    "group": "Blights",
    "hit points": "26 (4d8 + 8)",
    "languages": [
        "Common"
    ],
    "name": "Vine Blight",
    "senses": [
        "blindsight 60 ft. (blind beyond this radius)"
    ],
    "size": "Medium",
    "skills": {
        "Stealth": 1
    },
    "speed": [
        "10 ft."
    ],
    "traits": [
        [
            "False Appearance",
            "While the blight remains motionless, it is indistinguishable from a tangle of vines."
        ]
    ],
    "type": "plant"
}