{
    "+": "FREE",
    "ability scores": {
        "cha": 10,
        "con": 14,
        "dex": 13,
        "int": 10,
        "str": 15,
        "wis": 11
    },
    "actions": [
        [
            "Multiattack (Humanoid or Hybrid Form Only)",
            "The werewolf makes two attacks: one with its bite and one with its claws or spear."
        ],
        [
            "Bite (Wolf or Hybrid Form Only)",
            "*Melee Weapon Attack:* +4 to hit, reach 5 ft., one target. *Hit:* 6 (1d8 + 2) piercing damage. If the target is a humanoid, it must succeed on a DC 12 Constitution saving throw or be cursed with werewolf lycanthropy."
        ],
        [
            "Claws (Hybrid Form Only)",
            "*Melee Weapon Attack:* +4 to hit, reach 5 ft., one creature. *Hit:* 7 (2d4 + 2) slashing damage."
        ],
        [
            "Spear (Humanoid Form Only)",
            "*Melee or Ranged Weapon Attack:* +4 to hit, reach 5 ft. or range 20/60 ft., one creature. Hit: 5 (1d6 + 2) piercing damage, or 6 (1d8 + 2) piercing damage if used with two hands to make a melee attack."
        ]
    ],
    "alignment": "chaotic evil",
    "armor class": "11 in humanoid form, 12 (natural armor) in wolf or hybrid form",
    "damage immunities": [
        "bludgeoning, piercing, and slashing damage from nonmagical attacks that aren't silvered"
    ],
    "description": [
        "A werewolf is a savage predator. In its humanoid form, a werewolf has heightened senses, a fiery temper, and a tendency to eat rare meat. Its wolf form is a fearsome predator, but its hybrid form is more terrifying by far - a furred and well-muscled humanoid body topped by a ravening wolf's head. A werewolf can wield weapons in hybrid form, though it prefers to tear foes apart with its powerful claws and bite.",
        "",
        "Most werewolves flee civilized lands not long after becoming afflicted. Those that reject the curse fear what will happen if they remain among their friends and family. Those that embrace the curse fear discovery and the consequences of their murderous acts. In the wild, werewolves form packs that also include wolves and dire wolves.",
        "",
        "> \"The Company of Black Moon - they used to be adventurers loyal to the realm. Now they roam the woods as a pack of werewolves. The king has promised estates, titles, and gold to anyone who can undo the curse afflicting them. I, for one, have no interest in such rewards.\"",
        ">",
        "> --Thornstaff, elf druid"
    ],
    "experience": 700,
    "group": "Lycanthropes",
    "hit points": "58 (9d8 + 18)",
    "languages": [
        "Common (can't speak in wolf form)"
    ],
    "name": "Werewolf",
    "size": "Medium",
    "skills": {
        "Perception": 4,
        "Stealth": 3
    },
    "speed": [
        "30 ft. (40 ft. in wolf form)"
    ],
    "traits": [
        [
            "Shapechanger",
            "The werewolf can use its action to polymorph into a wolf-humanoid hybrid or into a wolf, or back into its true form, which is humanoid. Its statistics, other than its AC, are the same in each form. Any equipment it is wearing or carrying isn't transformed. It reverts to its true form if it dies."
        ],
        [
            "Keen Hearing and Smell",
            "The werewolf has advantage on Wisdom (Perception) checks that rely on hearing or smell."
        ]
    ],
    "type": "humanoid (human, shapechanger)"
}