{
    "+": "SCAG",
    "@": "Monk",
    "description": [
        "*Sword Coast Adventurer's Guide*",
        "",
        "Followers of the Way of the Long Death worship the principle of death more so tha n a ny deity of death. These monks seek the secrets of life by studying death itself. It is the condition of being dead that concerns them most, and not what lies beyond; the afterlife holds little interest for them. Their monasteries are full of decaying, dying, and dead animal and plant specimens, which they study with detached interest. They frequently purchase rare specimens from adventurers and merchants that they can't obtain easily themselves. But such studies are only part of the monks' daily life: They seek to understand death as it pertains especially to intelligent living beings, and to this end they eagerly welcome the diseased and the dying so that they might watch and record their deaths. If such unfortunates seek release from pain through death, the monks provide it. They view death as a gift that they bestow on those who are ready for it. Their means of determining readiness vary from one sect (or even one monk) to another.",
        "",
        "The monks suffer no moral qualms about these deeds, for death is the most natural thing in the world, from their perspective, and to expire in service to its principle is one of the most profoundly holy experiences a living being can hope to enjoy. It is for this reason that the monks themselves do not fear death.",
        "",
        "Most of the order's members are either scholars who share mutual fascination with death and dying or clergy who worship one of the deities concerned with death. Some of the monks consider themselves to be nothing less than visionaries whose work will pave the way for a better future for all Faerûn. When death is truly understood, it can be harnessed and used as a tool for the betterment of all, or so they rationalize to themselves.",
        "",
        "Monks of this tradition follow the Way of the Long Death, which is described in the \"Monastic Traditions\" section below.",
        "",
        "Monks of the Way of the Long Death are obsessed with the meaning and mechanics of dying. They capture creatures and prepare elaborate experiments to capture, record, and understand the moments of their demise. They then use this knowledge to guide their understanding of martial arts, yielding a deadly fighting style."
    ],
    "features": [
        [],
        [],
        [],
        [
            "Touch of Death"
        ],
        [],
        [],
        [
            "Hour of Reaping"
        ],
        [],
        [],
        [],
        [],
        [
            "Mastery of Death"
        ],
        [],
        [],
        [],
        [],
        [],
        [
            "Touch of the Long Death"
        ],
        [],
        [],
        []
    ],
    "features-data": {
        "Hour of Reaping": [
            "At 6th level,you gain the ability to unsettle or terrify those around you as an action, for your soul has been touched by the shadow of death. When you take this action, each creature within 30 feet of you that can see you must succeed on a Wisdom saving throw or be frightened of you until the end of your next turn."
        ],
        "Mastery of Death": [
            "Beginning at 11th level, you use your familiarity with death to escape its grasp. When you are reduced to 0 hit points, you can expend 1 ki point (no action required) to have 1 hit point instead."
        ],
        "Touch of Death": [
            "Starting when you choose this tradition at 3rd level, your study of death allows you to extract vitality from another creature as it nears its demise. When you reduce a creature within 5 feet of you to 0 hit points, you gain temporary hit points equal to your Wisdom modifier + your monk level (minimum of 1 temporary hit point)."
        ],
        "Touch of the Long Death": [
            "Starting at 17th level, your touch can channel the energy of death into a creature. As an action, you touch one creature within 5 feet of you, and you expend 1 to 10 ki points. The target must make a Constitution saving throw, and it takes 2d10 necrotic damage per ki point spent on a failed save, or half as much damage on a successful one."
        ]
    },
    "name": "Way of the Long Death"
}
